const items = [
    "Рестораны",
    "Столовые / Кафе / Точки быстрого питания",
    "Храмы и места культа",
    "Гостиницы",
    "Мотели",
    "Кемпинги",
    "Глэмпинги",
    "Банные комплексы",
    "Аквапарки",
    "Музеи",
    "Цирки",
    "Экскурсии",
    "АЗС",
    "Сувенирные точки",
    "Центры бронирования экскурсий и экскурсоводов",
    "Народные промыслы",
    "Художественные галереи",
    "Объекты туристического показа (природные достопримечательности, памятные таблицы)",
    "Театры / Кинотеатры",
    "Зоопарки",
    "Ботанические сады",
    "Экскурсионные туры (пешие, автобусные, речные и т.д.)",
    "Событийные мероприятия (фестивали, концерты, спортивные соревнования)",
    "Станции технического обслуживания",
    "Пункты проката"
];

export default items;